Engeneros/LaserA29/code/lpc2148_ex.h
// // /* SSP0 Controller */
// // #define SSP0_BASE_ADDR		0xE0068000
// // #define SSP0CR0        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x00))
// // #define SSP0CR1        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x04))
// // #define SSP0DR         (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x08))
// // #define SSP0SR         (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x0C))
// // #define SSP0CPSR       (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x10))
// // #define SSP0IMSC       (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x14))
// // #define SSP0RIS        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x18))
// // #define SSP0MIS        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x1C))
// // #define SSP0ICR        (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x20))
// // #define SSP0DMACR      (*(volatile unsigned long *)(SSP0_BASE_ADDR + 0x24))

// /* SSP1 Controller */
// //#define SSP1_BASE_ADDR		0xE0030000
// const unsigned long SSP1_BASE_ADDR = 0xE0068000;
// #define SSP1CR0        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x00))
// #define SSP1CR1        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x04))
// #define SSP1DR         (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x08))
// #define SSP1SR         (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x0C))
// #define SSP1CPSR       (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x10))
// #define SSP1IMSC       (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x14))
// #define SSP1RIS        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x18))
// #define SSP1MIS        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x1C))
// #define SSP1ICR        (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x20))
// //#define SSP1DMACR      (*(volatile unsigned long *)(SSP1_BASE_ADDR + 0x24))

// struct RegsSPI
// {
// 	volatile unsigned short spcr;//0
// 		volatile unsigned short hole0;//2
// 	volatile unsigned char  spsr;//	4
// 		volatile unsigned char  hole1;//5
// 		volatile unsigned short hole2;//6
// 	volatile unsigned short spdr;//	8
// 		volatile unsigned short  hole3;//a
// 	volatile unsigned char  spccr;//     c
// 		volatile unsigned char  hole4;//d
// 		volatile unsigned short hole5;//e
// 		volatile unsigned long  hole6;//10
// 		volatile unsigned long  hole7;//14
// 		volatile unsigned long  hole8;//18
// 	volatile unsigned char  spint;//1c
// };

// struct RegsSSP
// {
// 	volatile unsigned short cr0;//0
// 		volatile unsigned short hole0;//2
// 	volatile unsigned char  cr1;//	4
// 		volatile unsigned char  hole1;//5
// 		volatile unsigned short hole2;//6
// 	volatile unsigned short dr;//	8
// 		volatile unsigned short  hole3;//a
// 	volatile unsigned char  sr;//     c
// 		volatile unsigned char  hole4;//d
// 		volatile unsigned short hole5;//e
// 	volatile unsigned char  cpsr;//10
// 		volatile unsigned char hole6;//11
// 		volatile unsigned short hole7;//12
// 	volatile unsigned char imsc;//	14
// 		volatile unsigned char hole8;//15
// 		volatile unsigned short hole9;//16
// 	volatile unsigned char ris;//	18
// 		volatile unsigned char hole10;//19
// 		volatile unsigned short hole11;//1a
// 	volatile unsigned char mis;//1c
// 		volatile unsigned char hole12;//1d
// 		volatile unsigned short hole13;//1e
// 	volatile unsigned char icr;//20	
// 		volatile unsigned char hole14;//21
// 		volatile unsigned short hole15;//22
// //	volatile unsigned char dmacr;//24	
// };



/* SPI0 (Serial Peripheral Interface 0) */
const unsigned long SSP0_BASE_ADDR  = 0xE0020000; ///SPI0_BASE_ADDR = 0xE0020000;
#define S0SPCR          (*((volatile unsigned short*) 0xE0020000))
#define S0SPSR          (*((volatile unsigned char *) 0xE0020004))
#define S0SPDR          (*((volatile unsigned short*) 0xE0020008))
#define S0SPCCR         (*((volatile unsigned char *) 0xE002000C))
#define S0SPINT         (*((volatile unsigned char *) 0xE002001C))

struct RegsSPI
{
	volatile unsigned short spcr;//0
		volatile unsigned short hole0;//2
	volatile unsigned char  spsr;//	4
		volatile unsigned char  hole1;//5
		volatile unsigned short hole2;//6
	volatile unsigned short spdr;//	8
		volatile unsigned short  hole3;//a
	volatile unsigned char  spccr;//     c
		volatile unsigned char  hole4;//d
		volatile unsigned short hole5;//e
		volatile unsigned long  hole6;//10
		volatile unsigned long  hole7;//14
		volatile unsigned long  hole8;//18
	volatile unsigned char  spint;//1c
};

/* SSP Controller (SPI1) */
const unsigned long SSP1_BASE_ADDR = 0xE0068000;
#define SSPCR0          (*((volatile unsigned short*) 0xE0068000))
#define SSPCR1          (*((volatile unsigned char *) 0xE0068004))
#define SSPDR           (*((volatile unsigned short*) 0xE0068008))
#define SSPSR           (*((volatile unsigned char *) 0xE006800C))
#define SSPCPSR         (*((volatile unsigned char *) 0xE0068010))
#define SSPIMSC         (*((volatile unsigned char *) 0xE0068014))
#define SSPRIS          (*((volatile unsigned char *) 0xE0068018))
#define SSPMIS          (*((volatile unsigned char *) 0xE006801C))
#define SSPICR          (*((volatile unsigned char *) 0xE0068020))
struct RegsSSP
{
	volatile unsigned short cr0;//0
		volatile unsigned short hole0;//2
	volatile unsigned char  cr1;//	4
		volatile unsigned char  hole1;//5
		volatile unsigned short hole2;//6
	volatile unsigned short dr;//	8
		volatile unsigned short  hole3;//a
	volatile unsigned char  sr;//     c
		volatile unsigned char  hole4;//d
		volatile unsigned short hole5;//e
	volatile unsigned char  cpsr;//10
		volatile unsigned char hole6;//11
		volatile unsigned short hole7;//12
	volatile unsigned char imsc;//	14
		volatile unsigned char hole8;//15
		volatile unsigned short hole9;//16
	volatile unsigned char ris;//	18
		volatile unsigned char hole10;//19
		volatile unsigned short hole11;//1a
	volatile unsigned char mis;//1c
		volatile unsigned char hole12;//1d
		volatile unsigned short hole13;//1e
	volatile unsigned char icr;//20	
};

 /* Real Time Clock */
#define RTC_BASE_ADDR		0xE0024000
#define RTC_ILR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x00))
#define RTC_CTC         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x04))
#define RTC_CCR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x08))
#define RTC_CIIR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x0C))
#define RTC_AMR         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x10))
#define RTC_CTIME0      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x14))
#define RTC_CTIME1      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x18))
#define RTC_CTIME2      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x1C))
#define RTC_SEC         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x20))
#define RTC_MIN         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x24))
#define RTC_HOUR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x28))
#define RTC_DOM         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x2C))
#define RTC_DOW         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x30))
#define RTC_DOY         (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x34))
#define RTC_MONTH       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x38))
#define RTC_YEAR        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x3C))
#define RTC_CISS        (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x40))
#define RTC_ALSEC       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x60))
#define RTC_ALMIN       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x64))
#define RTC_ALHOUR      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x68))
#define RTC_ALDOM       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x6C))
#define RTC_ALDOW       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x70))
#define RTC_ALDOY       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x74))
#define RTC_ALMON       (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x78))
#define RTC_ALYEAR      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x7C))
#define RTC_PREINT      (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x80))
#define RTC_PREFRAC     (*(volatile unsigned long *)(RTC_BASE_ADDR + 0x84))



//
// #define ILR             (*((volatile unsigned char *) 0xE0024000))
// #define CTC             (*((volatile unsigned short*) 0xE0024004))
// #define CCR             (*((volatile unsigned char *) 0xE0024008))
// #define CIIR            (*((volatile unsigned char *) 0xE002400C))
// #define AMR             (*((volatile unsigned char *) 0xE0024010))
// #define CTIME0          (*((volatile unsigned long *) 0xE0024014))
// #define CTIME1          (*((volatile unsigned long *) 0xE0024018))
// #define CTIME2          (*((volatile unsigned long *) 0xE002401C))
// #define SEC             (*((volatile unsigned char *) 0xE0024020))
// #define MIN             (*((volatile unsigned char *) 0xE0024024))
// #define HOUR            (*((volatile unsigned char *) 0xE0024028))
// #define DOM             (*((volatile unsigned char *) 0xE002402C))
// #define DOW             (*((volatile unsigned char *) 0xE0024030))
// #define DOY             (*((volatile unsigned short*) 0xE0024034))
// #define MONTH           (*((volatile unsigned char *) 0xE0024038))
// #define YEAR            (*((volatile unsigned short*) 0xE002403C))
// #define ALSEC           (*((volatile unsigned char *) 0xE0024060))
// #define ALMIN           (*((volatile unsigned char *) 0xE0024064))
// #define ALHOUR          (*((volatile unsigned char *) 0xE0024068))
// #define ALDOM           (*((volatile unsigned char *) 0xE002406C))
// #define ALDOW           (*((volatile unsigned char *) 0xE0024070))
// #define ALDOY           (*((volatile unsigned short*) 0xE0024074))
// #define ALMON           (*((volatile unsigned char *) 0xE0024078))
// #define ALYEAR          (*((volatile unsigned short*) 0xE002407C))
// #define PREINT          (*((volatile unsigned short*) 0xE0024080))
// #define PREFRAC         (*((volatile unsigned short*) 0xE0024084))

/* A/D Converter 0 (AD0) */
const unsigned long AD0_BASE_ADDR = 0xE0034000;
#define AD0CR           (*((volatile unsigned long *) 0xE0034000))
#define AD0GDR          (*((volatile unsigned long *) 0xE0034004))
#define AD0STAT         (*((volatile unsigned long *) 0xE0034030))
#define AD0INTEN        (*((volatile unsigned long *) 0xE003400C))
#define AD0DR0          (*((volatile unsigned long *) 0xE0034010))
#define AD0DR1          (*((volatile unsigned long *) 0xE0034014))
#define AD0DR2          (*((volatile unsigned long *) 0xE0034018))
#define AD0DR3          (*((volatile unsigned long *) 0xE003401C))
#define AD0DR4          (*((volatile unsigned long *) 0xE0034020))
#define AD0DR5          (*((volatile unsigned long *) 0xE0034024))
#define AD0DR6          (*((volatile unsigned long *) 0xE0034028))
#define AD0DR7          (*((volatile unsigned long *) 0xE003402C))

/* A/D Converter 1 (AD1) */
const unsigned long AD1_BASE_ADDR = 0xE0060000;
#define AD1CR           (*((volatile unsigned long *) 0xE0060000))
#define AD1GDR          (*((volatile unsigned long *) 0xE0060004))
#define AD1STAT         (*((volatile unsigned long *) 0xE0060030))
#define AD1INTEN        (*((volatile unsigned long *) 0xE006000C))
#define AD1DR0          (*((volatile unsigned long *) 0xE0060010))
#define AD1DR1          (*((volatile unsigned long *) 0xE0060014))
#define AD1DR2          (*((volatile unsigned long *) 0xE0060018))
#define AD1DR3          (*((volatile unsigned long *) 0xE006001C))
#define AD1DR4          (*((volatile unsigned long *) 0xE0060020))
#define AD1DR5          (*((volatile unsigned long *) 0xE0060024))
#define AD1DR6          (*((volatile unsigned long *) 0xE0060028))
#define AD1DR7          (*((volatile unsigned long *) 0xE006002C))

/* A/D Converter Global */
#define ADGSR           (*((volatile unsigned long *) 0xE0034008))

/* D/A Converter */
#define DACR            (*((volatile unsigned long *) 0xE006C000))

/* Watchdog */
#define WDMOD           (*((volatile unsigned char *) 0xE0000000))
#define WDTC            (*((volatile unsigned long *) 0xE0000004))
#define WDFEED          (*((volatile unsigned char *) 0xE0000008))
#define WDTV            (*((volatile unsigned long *) 0xE000000C))

/* USB Controller */
#define USBIntSt        (*((volatile unsigned long *) 0xE01FC1C0))
#define USBDevIntSt     (*((volatile unsigned long *) 0xE0090000))
#define USBDevIntEn     (*((volatile unsigned long *) 0xE0090004))
#define USBDevIntClr    (*((volatile unsigned long *) 0xE0090008))
#define USBDevIntSet    (*((volatile unsigned long *) 0xE009000C))
#define USBDevIntPri    (*((volatile unsigned char *) 0xE009002C))
#define USBEpIntSt      (*((volatile unsigned long *) 0xE0090030))
#define USBEpIntEn      (*((volatile unsigned long *) 0xE0090034))
#define USBEpIntClr     (*((volatile unsigned long *) 0xE0090038))
#define USBEpIntSet     (*((volatile unsigned long *) 0xE009003C))
#define USBEpIntPri     (*((volatile unsigned long *) 0xE0090040))
#define USBReEp         (*((volatile unsigned long *) 0xE0090044))
#define USBEpInd        (*((volatile unsigned long *) 0xE0090048))
#define USBMaxPSize     (*((volatile unsigned long *) 0xE009004C))
#define USBRxData       (*((volatile unsigned long *) 0xE0090018))
#define USBRxPLen       (*((volatile unsigned long *) 0xE0090020))
#define USBTxData       (*((volatile unsigned long *) 0xE009001C))
#define USBTxPLen       (*((volatile unsigned long *) 0xE0090024))
#define USBCtrl         (*((volatile unsigned long *) 0xE0090028))
#define USBCmdCode      (*((volatile unsigned long *) 0xE0090010))
#define USBCmdData      (*((volatile unsigned long *) 0xE0090014))
#define USBDMARSt       (*((volatile unsigned long *) 0xE0090050))
#define USBDMARClr      (*((volatile unsigned long *) 0xE0090054))
#define USBDMARSet      (*((volatile unsigned long *) 0xE0090058))
#define USBUDCAH        (*((volatile unsigned long *) 0xE0090080))
#define USBEpDMASt      (*((volatile unsigned long *) 0xE0090084))
#define USBEpDMAEn      (*((volatile unsigned long *) 0xE0090088))
#define USBEpDMADis     (*((volatile unsigned long *) 0xE009008C))
#define USBDMAIntSt     (*((volatile unsigned long *) 0xE0090090))
#define USBDMAIntEn     (*((volatile unsigned long *) 0xE0090094))
#define USBEoTIntSt     (*((volatile unsigned long *) 0xE00900A0))
#define USBEoTIntClr    (*((volatile unsigned long *) 0xE00900A4))
#define USBEoTIntSet    (*((volatile unsigned long *) 0xE00900A8))
#define USBNDDRIntSt    (*((volatile unsigned long *) 0xE00900AC))
#define USBNDDRIntClr   (*((volatile unsigned long *) 0xE00900B0))
#define USBNDDRIntSet   (*((volatile unsigned long *) 0xE00900B4))
#define USBSysErrIntSt  (*((volatile unsigned long *) 0xE00900B8))
#define USBSysErrIntClr (*((volatile unsigned long *) 0xE00900BC))
#define USBSysErrIntSet (*((volatile unsigned long *) 0xE00900C0))

#endif  // __LPC214x_H
